CREATE DATABASE IF NOT EXISTS dog DEFAULT CHARSET utf8mb4 COLLATE UTF8MB4_GENERAL_CI;
USE dog;
CREATE TABLE IF NOT EXISTS t_product
(
    id          VARCHAR(36) PRIMARY KEY,
    name        VARCHAR(256),
    description VARCHAR(1024),
    price       DECIMAL(10, 2),
    qty         INT,
    create_time DATETIME
);
INSERT INTO t_product (id, name, description, price, qty, create_time)
VALUES ('10c6e233-fdee-11ee-82f0-0242ac120003', 'T恤衫', '纯棉圆领T恤衫', 19.99, 100, '2023-05-15 08:30:00'),
       ('10c6e5a3-fdee-11ee-82f0-0242ac120003', '牛仔裤', '蓝色牛仔裤，修身款', 39.99, 80, '2023-05-15 09:15:00'),
       ('10c6e758-fdee-11ee-82f0-0242ac120003', '跑步鞋', '轻质跑步鞋，尺码9', 59.99, 50, '2023-05-15 09:45:00'),
       ('10c6e841-fdee-11ee-82f0-0242ac120003', '背包', '防水背包，带笔记本电脑隔层', 49.99, 30, '2023-05-15 10:20:00'),
       ('10c6e920-fdee-11ee-82f0-0242ac120003', '智能手机', '6.5英寸OLED屏幕，128GB存储', 699.99, 20,
        '2023-05-15 10:50:00'),
       ('10c6ea02-fdee-11ee-82f0-0242ac120003', '耳机', '无线降噪耳罩式耳机', 199.99, 15, '2023-05-15 11:30:00'),
       ('10c6ead5-fdee-11ee-82f0-0242ac120003', '手表', '不锈钢表壳，皮质表带', 149.99, 25, '2023-05-15 12:10:00'),
       ('10c6ec0d-fdee-11ee-82f0-0242ac120003', '笔记本电脑', '13英寸超极本，搭载Intel Core i5处理器', 999.99, 10,
        '2023-05-15 13:00:00'),
       ('10c6eeac-fdee-11ee-82f0-0242ac120003', '太阳镜', '偏光太阳镜，UV防护', 79.99, 40, '2023-05-15 13:45:00'),
       ('10c6f03a-fdee-11ee-82f0-0242ac120003', '瑜伽垫', '环保防滑瑜伽垫', 29.99, 60, '2023-05-15 14:30:00'),
       ('10c6f1a9-fdee-11ee-82f0-0242ac120003', '哑铃组', '可调节哑铃组，每个20磅', 89.99, 20, '2023-05-15 15:15:00'),
       ('10c6f301-fdee-11ee-82f0-0242ac120003', '搅拌机', '高速搅拌机，多重预设', 79.99, 10, '2023-05-15 16:00:00'),
       ('10c6f458-fdee-11ee-82f0-0242ac120003', '电视机', '55英寸4K LED智能电视', 799.99, 5, '2023-05-15 16:45:00'),
       ('10c6f53d-fdee-11ee-82f0-0242ac120003', '炊具套装', '10件不粘炊具套装', 129.99, 15, '2023-05-15 17:30:00'),
       ('10c6f60c-fdee-11ee-82f0-0242ac120003', '自行车', '混合自行车，21速，铝合金车架', 399.99, 8,
        '2023-05-15 18:15:00'),
       ('10c6f6e4-fdee-11ee-82f0-0242ac120003', '吸尘器', '无袋立式吸尘器', 149.99, 12, '2023-05-15 19:00:00'),
       ('10c6f7b0-fdee-11ee-82f0-0242ac120003', '咖啡机', '可编程咖啡机，带保温热水壶', 79.99, 18,
        '2023-05-15 19:45:00'),
       ('10c6f887-fdee-11ee-82f0-0242ac120003', '烤面包机', '不锈钢4片烤面包机，带解冻功能', 49.99, 25,
        '2023-05-15 20:30:00'),
       ('10c6f957-fdee-11ee-82f0-0242ac120003', '地毯', '5x7尺地毯，几何图案', 149.99, 6, '2023-05-15 21:15:00'),
       ('10c6fa28-fdee-11ee-82f0-0242ac120003', '台灯', 'LED台灯，可调节亮度', 34.99, 20, '2023-05-15 22:00:00');
